src/InformationRegisters/ПройденныеТесты/ПройденныеТесты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПройденныеТесты</name>
  <resources>
    <name>ТестПройден</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>стрСтатус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Коммит</name>
    <type>
      <types>CatalogRef.ИсторияХранилища</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тест</name>
    <type>
      <types>CatalogRef.Тесты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СломанныеТесты/СломанныеТесты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СломанныеТесты</name>
  <resources>
    <name>КоммитИсправления</name>
    <type>
      <types>CatalogRef.ИсторияХранилища</types>
    </type>
  </resources>
  <resources>
    <name>Исправлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Коммит</name>
    <type>
      <types>CatalogRef.ИсторияХранилища</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тест</name>
    <type>
      <types>CatalogRef.Тесты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ПройденныеТесты/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура Отразить(Коммит, ПройденныеТесты) Экспорт
	
	НачатьТранзакцию();
	
	Для Каждого Строка Из ПройденныеТесты Цикл
		мз = РегистрыСведений.ПройденныеТесты.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(мз, Строка);
		мз.Коммит = Коммит;
		мз.ТестПройден = мз.стрСтатус = "success";
		мз.Записать();
	КонецЦикла;
	
	РегистрыСведений.СломанныеТесты.Отразить(Коммит);
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
